![](pic/mysql2.jpg)

In [1]:
import pymysql
pymysql.install_as_MySQLdb()
%load_ext sql
%sql mysql://root:hannam@localhost/galaxy

C:\Users\PC-14\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xB4\\xEB\\xC7\\xD1\\xB9\\xCE...' for column 'VARIABLE_VALUE' at row 518")
  result = self._query(query)
C:\Users\PC-14\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (3719, "'utf8' is currently an alias for the character set UTF8MB3, but will be an alias for UTF8MB4 in a future release. Please consider using UTF8MB4 in order to be unambiguous.")
  result = self._query(query)

'Connected: root@galaxy'

## <span style="color:red">** 연습문제 **</span>

In [6]:
%%sql
select * from employees;

 * mysql://root:***@localhost/galaxy
19 rows affected.

[(100, 'Steven', 'King', 'SKING', '515.123.4567', datetime.date(1987, 6, 17), 'AD_PRES', Decimal('100000.00'), None, None, 90),
 (101, 'Neena', 'Kochhar', 'NKOCHHAR', '515.123.4568', datetime.date(1989, 9, 21), 'AD_VP', Decimal('100000.00'), None, 100, 90),
 (102, 'Lex', 'De Haan', 'LDEHAAN', '515.123.4569', datetime.date(1993, 1, 13), 'AD_VP', Decimal('100000.00'), None, 100, 90),
 (103, 'Alexander', 'Hunold', 'AHUNOLD', '590.423.4567', datetime.date(1990, 1, 3), 'IT_PROG', Decimal('100000.00'), None, 102, 90),
 (104, 'Bruce', 'Ernst', 'BERNST', '590.423.4568', datetime.date(1991, 5, 21), 'IT_PROG', Decimal('100000.00'), None, 103, 90),
 (107, 'Diana', 'Lorentz', 'DLORENTZ', '590.423.5567', datetime.date(1999, 2, 7), 'IT_PROG', Decimal('100000.00'), None, 103, 90),
 (124, 'Kevin', 'Mourgos', 'KMOURGOS', '650.123.5234', datetime.date(1999, 11, 16), 'ST_MAN', Decimal('100000.00'), None, 100, 50),
 (141, 'Trenna', 'Rajs', 'TRAJS', '650.121.8009', datetime.date(1995, 10, 17), 'ST_CLERK', Decimal('100000.00'), None, 124, 50),
 (142, 'Curtis', 'Davies', 'CDAVIES', '650.121.2994', datetime.date(1997, 1, 29), 'ST_CLERK', Decimal('100000.00'), None, 124, 50),
 (143, 'Randall', 'Matos', 'RMATOS', '650.121.2874', datetime.date(1998, 3, 15), 'ST_CLERK', Decimal('100000.00'), None, 124, 50),
 (144, 'Peter', 'Vargas', 'PVARGAS', '650.121.2004', datetime.date(1998, 7, 9), 'ST_CLERK', Decimal('100000.00'), None, 124, 50),
 (149, 'Eleni', 'Zlotkey', 'EZLOTKEY', '011.44.1344.429018', datetime.date(2000, 1, 29), 'SA_MAN', Decimal('100000.00'), Decimal('0.20'), 100, 80),
 (176, 'Jonathon', 'Taylor', 'JTAYLOR', '011.44.1644.429265', datetime.date(1998, 3, 24), 'SA_REP', Decimal('100000.00'), Decimal('0.20'), 149, 80),
 (178, 'Kimberely', 'Grant', 'KGRANT', '011.44.1644.429263', datetime.date(1999, 5, 24), 'SA_REP', Decimal('100000.00'), Decimal('0.15'), 149, None),
 (200, 'Jennifer', 'Whalen', 'JWHALEN', '515.123.4444', datetime.date(1987, 9, 17), 'AD_ASST', Decimal('100000.00'), None, 101, 10),
 (201, 'Michael', 'Hartstein', 'MHARTSTE', '515.123.5555', datetime.date(1996, 2, 17), 'MK_MAN', Decimal('100000.00'), None, 100, 20),
 (202, 'Pat', 'Fay', 'PFAY', '603.123.6666', datetime.date(1997, 8, 17), 'MK_REP', Decimal('100000.00'), None, 201, 20),
 (205, 'Shelley', 'Higgins', 'SHIGGINS', '515.123.8080', datetime.date(1994, 6, 7), 'AC_MGR', Decimal('100000.00'), None, 101, 50),
 (206, 'William', 'Gietz', 'WGIETZ', '515.123.8181', datetime.date(1994, 6, 7), 'AC_ACCOUNT', Decimal('100000.00'), None, 205, 50)]

<br><br>
<span style="color:red">[연습 10]</span>   
사원번호가 176번인 종업원의 사원이름과 사원번호를 나타내는 질의어를 작성하라.

In [2]:
%%sql
select first_name, employee_id
from employees
where employee_id = 176;

 * mysql://root:***@localhost/galaxy
1 rows affected.

[('Jonathon', 176)]

<br><br>
<span style="color:red">[연습 11]</span>   
급여가 5000에서 12000사이에 포함되지 않는 종업원의 사원이름과 급여를 나타내는 질의어를 작성하라.

In [3]:
%%sql
select first_name, salary
from employees
where salary not between 5000 and 12000;

 * mysql://root:***@localhost/galaxy
19 rows affected.

[('Steven', Decimal('100000.00')),
 ('Neena', Decimal('100000.00')),
 ('Lex', Decimal('100000.00')),
 ('Alexander', Decimal('100000.00')),
 ('Bruce', Decimal('100000.00')),
 ('Diana', Decimal('100000.00')),
 ('Kevin', Decimal('100000.00')),
 ('Trenna', Decimal('100000.00')),
 ('Curtis', Decimal('100000.00')),
 ('Randall', Decimal('100000.00')),
 ('Peter', Decimal('100000.00')),
 ('Eleni', Decimal('100000.00')),
 ('Jonathon', Decimal('100000.00')),
 ('Kimberely', Decimal('100000.00')),
 ('Jennifer', Decimal('100000.00')),
 ('Michael', Decimal('100000.00')),
 ('Pat', Decimal('100000.00')),
 ('Shelley', Decimal('100000.00')),
 ('William', Decimal('100000.00'))]

<br><br>
<span style="color:red">[연습 12]</span>   
2011년 2월 20일과 1998년 5월 1일 사이에 입사한 사원이름과 업무 ID 및 입사일을 나타내되 입사일을 기준으로 오름차순으로 정렬하라.

In [7]:
%%sql
select first_name, manager_id, hire_date
from employees
where hire_date between '1998-5-1' and '2011-2-20'
order by hire_date asc;

 * mysql://root:***@localhost/galaxy
5 rows affected.

[('Peter', 124, datetime.date(1998, 7, 9)),
 ('Diana', 103, datetime.date(1999, 2, 7)),
 ('Kimberely', 149, datetime.date(1999, 5, 24)),
 ('Kevin', 100, datetime.date(1999, 11, 16)),
 ('Eleni', 100, datetime.date(2000, 1, 29))]

<br><br>
<span style="color:red">[연습 13]</span>   
부서 20 또는 부서 50에 소속된 사원이름과 부서이름을 나타내되 사원이름을 기준으로 알파벳순으로 정렬하라.

In [8]:
%%sql
select first_name, department_id
from employees
where department_id = 20 or department_id = 50
order by first_name asc;

 * mysql://root:***@localhost/galaxy
9 rows affected.

[('Curtis', 50),
 ('Kevin', 50),
 ('Michael', 20),
 ('Pat', 20),
 ('Peter', 50),
 ('Randall', 50),
 ('Shelley', 50),
 ('Trenna', 50),
 ('William', 50)]

<br><br>
<span style="color:red">[연습 14]</span>   
급여가 5000 에서 12000 사이 이고, 부서 20 또는 부서 50에 소속된 사원의 이름과 급여를 나타내라.

In [9]:
%%sql
select first_name, salary
from employees
where salary between 5000 and 12000
and department_id = 20 or department_id = 50;

 * mysql://root:***@localhost/galaxy
7 rows affected.

[('Kevin', Decimal('100000.00')),
 ('Trenna', Decimal('100000.00')),
 ('Curtis', Decimal('100000.00')),
 ('Randall', Decimal('100000.00')),
 ('Peter', Decimal('100000.00')),
 ('Shelley', Decimal('100000.00')),
 ('William', Decimal('100000.00'))]

<br><br>
<span style="color:red">[연습 15]</span>   
2000년에 입사한 사원의 이름과 입사일을 나타내라.

In [51]:
%%sql
select first_name, hire_date
from employees
where hire_date like '2000%'

 * mysql://root:***@localhost/galaxy
1 rows affected.

[('Eleni', datetime.date(2000, 1, 29))]

<br><br>
<span style="color:red">[연습 16]</span>   
관리자가 없는 모든 사원의 이름과 업무를 표시하라.

In [25]:
%%sql
select first_name, department_id
from employees
where manager_id is null;

 * mysql://root:***@localhost/galaxy
1 rows affected.

[('Steven', 90)]

<br><br>
<span style="color:red">[연습 17]</span>   
커미션을 받는 모든 사원의 이름, 급여 및 커미션을 급여 및 커미션을 기준으로 내림차순으로 정렬하라.

In [37]:
%%sql
select first_name, salary, commission_pct
from employees
where not commission_pct is null
order by commission_pct desc;

 * mysql://root:***@localhost/galaxy
3 rows affected.

[('Eleni', Decimal('100000.00'), Decimal('0.20')),
 ('Jonathon', Decimal('100000.00'), Decimal('0.20')),
 ('Kimberely', Decimal('100000.00'), Decimal('0.15'))]

<br><br>
<span style="color:red">[연습 18]</span>   
이름의 세번째 문자가 a인  모든 사원의 이름을 표시하라.

In [45]:
%%sql
select first_name
from employees
where first_name like '__a%'

 * mysql://root:***@localhost/galaxy
1 rows affected.

[('Diana',)]

<br><br>
<span style="color:red">[연습 19]</span>   
이름에 a가 있는 모든 사원의 이름을 표시하라.

In [47]:
%%sql
select first_name
from employees
where first_name like '%a%'

 * mysql://root:***@localhost/galaxy
9 rows affected.

[('Pat',),
 ('William',),
 ('Michael',),
 ('Alexander',),
 ('Neena',),
 ('Diana',),
 ('Randall',),
 ('Trenna',),
 ('Jonathon',)]

<br><br>
<span style="color:red">[연습 20]</span>   
이름에 a가 먼저 나오고 e가 나중에 나오는 모든 사원의 이름을 표시하라.

In [49]:
%%sql
select first_name
from employees
where first_name like 'a%e%'

 * mysql://root:***@localhost/galaxy
1 rows affected.

[('Alexander',)]

<br><br>
<span style="color:red">[연습 21]</span>   
이름에 a와 e가 모두 나오는 모든 사원의 이름을 표시하라.

In [50]:
%%sql
select first_name
from employees
where first_name like '%a%e%'

 * mysql://root:***@localhost/galaxy
2 rows affected.

[('Michael',), ('Alexander',)]